# Análisis y Visualización de Datos de Ventas

Archivo:sales_data_dirty.xlxs

In [2]:
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns

Cargar el archivo el local:

In [ ]:
datos= pd.ExcelFile("sales_data_dirty.xlsx")

Cargar el archivo desde una URL:

In [14]:
datosU= pd.ExcelFile("https://github.com/adelnehme/python-for-excel-users-webinar/blob/master/sales_data_dirty.xlsx?raw=true")

In [16]:
datosU.sheet_names

['sales', 'customers', 'dates', 'employees']

In [5]:
datos.sheet_names

['sales', 'customers', 'dates', 'employees']

In [6]:
type(datos.sheet_names)

list

In [9]:
datos.sheet_names[0]

'sales'

In [17]:
## DataFrames
sales=datos.parse("sales")
customers=datos.parse("customers")
dates=datos.parse("dates")
employees=datos.parse("employees")

## Datos de ventas: sales

In [18]:
sales.shape

(31465, 5)

In [19]:
sales.head()

   SalesOrderID    TotalDue  NumberofItems  OnlineOrderFlag  Status
0         43659  23153.2339             12                0       5
1         43660   1457.3288              2                0       5
2         43661  36865.8012             15                0       5
3         43662  32474.9324             22                0       5
4         43663    472.3108              1                0       5

In [20]:
sales.tail()

       SalesOrderID  TotalDue  NumberofItems  OnlineOrderFlag  Status
31460         75119   46.7194              3                1       5
31461         75120   93.8808              3                1       5
31462         75121   82.8529              3                1       5
31463         75122   34.2219              2                1       5
31464         75123  209.9169              3                1       5

In [28]:
sales.sample(10)

       SalesOrderID   TotalDue  NumberofItems  OnlineOrderFlag  Status
10591         54250  2604.4298              4                1       5
7876          51535  1879.5940              1                1       5
14693         58352  2574.6279              2                1       5
24903         68562    54.6754              2                1       5
27245         70904    40.0784              3                1       5
14638         58297    87.2729              2                1       5
6526          50185  2264.2536              1                1       5
3043          46702  2699.9018              1                1       5
24825         68484    66.8194              3                1       5
6148          49807  2288.9187              1                1       5

In [42]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SalesOrderID     31465 non-null  int64
 1   TotalDue         31465 non-null  float64
 2   NumberofItems    31465 non-null  int64
 3   OnlineOrderFlag  31465 non-null  int64
 4   Status           31465 non-null  int64
dtypes: float64(1), int64(4)
memory usage: 1.2 MB

In [41]:
sales.describe()

       SalesOrderID       TotalDue  NumberofItems  OnlineOrderFlag   Status
count  31465.000000   31465.000000   31465.000000     31465.000000  31465.0
mean   59391.000000    3915.995109       3.855617         0.879040      5.0
std     9083.307446   12515.462713       7.214877         0.326086      0.0
min    43659.000000       1.518300       1.000000         0.000000      5.0
25%    51525.000000      62.951900       1.000000         1.000000      5.0
50%    59391.000000     865.204000       2.000000         1.000000      5.0
75%    67257.000000    2615.490800       3.000000         1.000000      5.0
max    75123.000000  187487.825000      72.000000         1.000000      5.0

## Datos de clientes: customers

In [29]:
customers.shape

(31465, 6)

In [30]:
customers.head()

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
0,43659,NaN,NaN,Tsvi,Reiter,NaN
1,43660,NaN,NaN,Tsvi,Reiter,NaN
2,43661,NaN,NaN,José,Saraiva,NaN
3,43662,NaN,NaN,José,Saraiva,NaN
4,43663,NaN,NaN,Linda,Mitchell,NaN

In [31]:
customers.tail()

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
31460,75119,Alisha,Hu,NaN,NaN,B2C
31461,75120,Natasha,Romero,NaN,NaN,B2C
31462,75121,Timothy,Sanchez,NaN,NaN,B2C
31463,75122,José,Perez,NaN,NaN,B2C
31464,75123,Joshua,Johnson,NaN,NaN,B2C

In [32]:
customers.sample(10)

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
3971,47630,NaN,NaN,NaN,NaN,NaN
26752,70411,NaN,NaN,NaN,NaN,NaN
26002,69661,Edwin,Li,NaN,NaN,B2C
12572,56231,Brandon,White,NaN,NaN,B2C
17157,60816,Luke,Hernandez,NaN,NaN,B2C
12958,56617,NaN,NaN,NaN,NaN,NaN
9467,53126,Nicole,Thompson,NaN,NaN,B2C
24144,67803,Gary,Rubio,NaN,NaN,B2C
29071,72730,Richard,James,NaN,NaN,B2C
18323,61982,Destiny,Martin,NaN,NaN,B2C

In [34]:
type(sales)

pandas.core.frame.DataFrame

In [37]:
sales[sales["SalesOrderID"]==47630]

      SalesOrderID   TotalDue  NumberofItems  OnlineOrderFlag  Status
3971         47630  2288.9187              1                1       5

In [38]:
sales[sales["SalesOrderID"]==70411]

       SalesOrderID  TotalDue  NumberofItems  OnlineOrderFlag  Status
26752         70411   43.0729              2                1       5

In [43]:
customers.sample(10)

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
30737,74396,Nathan,Phillips,NaN,NaN,B2C
20991,64650,Brittney,Wu,NaN,NaN,B2C
14460,58119,NaN,NaN,NaN,NaN,NaN
12787,56446,Jimmy,Vazquez,NaN,NaN,B2C
11843,55502,Destiny,Sanchez,NaN,NaN,B2C
28051,71710,Natalie,Johnson,NaN,NaN,B2C
2563,46222,Albert,Gomez,NaN,NaN,B2C
27246,70905,Isaiah,Hill,NaN,NaN,B2C
21622,65281,NaN,NaN,Michael,Blythe,NaN
15039,58698,Samantha,Garcia,NaN,NaN,B2C

In [44]:
sales[sales["SalesOrderID"]==58119]

       SalesOrderID   TotalDue  NumberofItems  OnlineOrderFlag  Status
14460         58119  1381.0732              2                1       5

In [45]:
sales[sales["SalesOrderID"]==65281]

       SalesOrderID    TotalDue  NumberofItems  OnlineOrderFlag  Status
21622         65281  31835.8602             18                0       5

## Datos de fechas: dates

In [46]:
dates.shape

(31465, 3)

In [49]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SalesOrderID  31465 non-null  int64
 1   OrderDate     31465 non-null  object
 2   ShipDate      31465 non-null  object
dtypes: int64(1), object(2)
memory usage: 737.6+ KB

In [48]:
dates.describe()

       SalesOrderID
count  31465.000000
mean   59391.000000
std     9083.307446
min    43659.000000
25%    51525.000000
50%    59391.000000
75%    67257.000000
max    75123.000000

In [50]:
dates.head()

   SalesOrderID            OrderDate             ShipDate
0         43659  2011-05-31 00:00:00  2011-06-07 00:00:00
1         43660  2011-05-31 00:00:00  2011-06-07 00:00:00
2         43661  2011-05-31 00:00:00  2011-06-07 00:00:00
3         43662  2011-05-31 00:00:00  2011-06-07 00:00:00
4         43663  2011-05-31 00:00:00  2011-06-07 00:00:00

In [51]:
dates.tail()

       SalesOrderID            OrderDate             ShipDate
31460         75119  2014-06-30 00:00:00  2014-07-07 00:00:00
31461         75120  2014-06-30 00:00:00  2014-07-07 00:00:00
31462         75121  2014-06-30 00:00:00  2014-07-07 00:00:00
31463         75122  2014-06-30 00:00:00  2014-07-07 00:00:00
31464         75123  2014-06-30 00:00:00  2014-07-07 00:00:00

In [53]:
dates.sample(10)

       SalesOrderID            OrderDate             ShipDate
22387         66046  2014-02-09 00:00:00  2014-02-16 00:00:00
4225          47884  2012-09-19 00:00:00  2012-09-26 00:00:00
13454         57113  2013-09-30 00:00:00  2013-10-07 00:00:00
5734          49393  2013-01-21 00:00:00  2013-01-28 00:00:00
22174         65833  2014-02-06 00:00:00  2014-02-13 00:00:00
15451         59110  2013-10-30 00:00:00  2013-11-06 00:00:00
21934         65593  2014-02-02 00:00:00  2014-02-09 00:00:00
21527         65186  2014-01-29 00:00:00  2014-02-05 00:00:00
5197          48856  2012-12-07 00:00:00  2012-12-14 00:00:00
11076         54735  2013-08-20 00:00:00  2013-08-27 00:00:00

## Datos de empleados: employees

In [54]:
employees.shape

(17, 5)

In [55]:
employees.head(17)

   FirstName           LastName CountryCode      RegionName  CommissionPct
0        Amy            Alberts          GB  United Kingdom          0.000
1      David           Campbell          US       Northwest          0.012
2    Garrett             Vargas          CA          Canada          0.010
3        Jae                Pak          CA          Canada          0.020
4    Jillian             Carson          US       Southwest          0.015
5       José            Saraiva          GB  United Kingdom          0.015
6      Linda           Mitchell          US       Southwest          0.015
7       Lynn           Tsoflias          AU       Australia          0.018
8    Michael             Blythe          US       Southwest          0.012
9     Pamela       Ansman-Wolfe          US       Northwest          0.010
10    Rachel             Valdez          DE         Germany          0.018
11    Ranjit  Varkey Chudukatil          FR          France          0.016
12       Shu                Ito          US       Southwest          0.010
13   Stephen              Jiang          US       Southwest          0.000
14      Syed              Abbas          AU       Australia          0.000
15      Tete        Mensa-Annan          US       Northwest          0.019
16      Tsvi             Reiter          US       Southeast          0.010

In [56]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   FirstName      17 non-null     object
 1   LastName       17 non-null     object
 2   CountryCode    17 non-null     object
 3   RegionName     17 non-null     object
 4   CommissionPct  17 non-null     float64
dtypes: float64(1), object(4)
memory usage: 808.0+ bytes

In [57]:
employees.describe()

       CommissionPct
count      17.000000
mean        0.011765
std         0.006495
min         0.000000
25%         0.010000
50%         0.012000
75%         0.016000
max         0.020000

### Análisis general

Revisión de valores únicos.

In [58]:
sales.sample(5)

       SalesOrderID   TotalDue  NumberofItems  OnlineOrderFlag  Status
3866          47525  2410.6266              1                1       5
29479         73138     8.0444              2                1       5
27405         71064  2574.6390              2                1       5
25663         69322  2708.6865              2                1       5
13115         56774    75.6815              2                1       5

In [60]:
print(sales["OnlineOrderFlag"].unique())

[0 1]

In [61]:
print(sales["Status"].unique())

[5]

Revisión de valores faltantes (missing values):

In [63]:
customers.isna().sum()

SalesOrderID             0
CustomerFirstName    14002
CustomerLastName     14002
EmployeeFirstName    27659
EmployeeLastName     27659
ChannelType          14002
dtype: int64

Reemplazar el OnlineOrderFlag:
0 -: offline
1 -: online

In [64]:
sales["OnlineOrderFlag"]= sales["OnlineOrderFlag"].replace( {0: "offline", 1: "online"})

In [68]:
sales.sample(3)

       SalesOrderID    TotalDue  NumberofItems OnlineOrderFlag  Status
660           44319  38566.9973             14         offline       5
26230         69889    132.5779              2          online       5
7439          51098   1514.0060              1         offline       5

In [69]:
sales["OnlineOrderFlag"].unique()

array(['offline', 'online'], dtype=object)

In [72]:
sales["OnlineOrderFlag"].describe()

count      31465
unique         2
top       online
freq       27659
Name: OnlineOrderFlag, dtype: object

In [ ]:
Eliminar la columna Status de sales:

In [74]:
sales.drop("Status",axis=1, inplace=True)
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SalesOrderID     31465 non-null  int64
 1   TotalDue         31465 non-null  float64
 2   NumberofItems    31465 non-null  int64
 3   OnlineOrderFlag  31465 non-null  object
dtypes: float64(1), int64(2), object(1)
memory usage: 983.4+ KB

Convertir las columnas de fechas (OrderDate y ShipDate) en formato de fecha (datetime) : Y - m - d

In [78]:
dates["OrderDate"] = pd.to_datetime(dates["OrderDate"], format ="%Y-%m-%d" )

In [79]:
dates["ShipDate"] = pd.to_datetime(dates["ShipDate"], format ="%Y-%m-%d" )

In [80]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SalesOrderID  31465 non-null  int64
 1   OrderDate     31465 non-null  datetime64[ns]
 2   ShipDate      31465 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1)
memory usage: 737.6 KB

In [81]:
dates.sample(3)

       SalesOrderID  OrderDate   ShipDate
23883         67542 2014-03-03 2014-03-10
1801          45460 2012-01-19 2012-01-26
30190         73849 2014-05-26 2014-06-02

Tratar de completar los datos de customers:

In [83]:
customers.sample(5)

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
20805,64464,Isaac,Hill,NaN,NaN,B2C
3878,47537,Colin,Lin,NaN,NaN,B2C
10477,54136,NaN,NaN,NaN,NaN,NaN
1255,44914,Dylan,Anderson,NaN,NaN,B2C
7342,51001,NaN,NaN,NaN,NaN,NaN

Hipótesis para completar Channel Type:

1) Nombres de los empleados son nulos => B2C
2) Nombres de los clientes nulos => B2B

In [84]:
customers.loc[ customers["EmployeeFirstName"].isnull(), "ChannelType"] = "B2C"
customers.loc[ customers["EmployeeFirstName"].notnull(), "ChannelType"] = "B2B" ##  customers["CustomerFirstName"].isnull()
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31465 entries, 0 to 31464
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   SalesOrderID       31465 non-null  int64
 1   CustomerFirstName  17463 non-null  object
 2   CustomerLastName   17463 non-null  object
 3   EmployeeFirstName  3806 non-null   object
 4   EmployeeLastName   3806 non-null   object
 5   ChannelType        31465 non-null  object
dtypes: int64(1), object(5)
memory usage: 1.4+ MB

In [86]:
customers.sample(5)

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType
22797,66456,NaN,NaN,NaN,NaN,B2C
7423,51082,NaN,NaN,Linda,Mitchell,B2B
20786,64445,Naomi,Hernandez,NaN,NaN,B2C
27259,70918,NaN,NaN,NaN,NaN,B2C
25606,69265,John,Jackson,NaN,NaN,B2C

Crear una sola columna para clientes y poner el nombre completo del empleado que hizo esa venta

In [87]:
customers["Fullname"] = customers["EmployeeFirstName"] +" "+ customers["EmployeeLastName"]
customers.head()

,SalesOrderID,CustomerFirstName,CustomerLastName,EmployeeFirstName,EmployeeLastName,ChannelType,Fullname
0,43659,NaN,NaN,Tsvi,Reiter,B2B,Tsvi Reiter
1,43660,NaN,NaN,Tsvi,Reiter,B2B,Tsvi Reiter
2,43661,NaN,NaN,José,Saraiva,B2B,José Saraiva
3,43662,NaN,NaN,José,Saraiva,B2B,José Saraiva
4,43663,NaN,NaN,Linda,Mitchell,B2B,Linda Mitchell

In [88]:
employees["Fullname"] = employees["FirstName"] +" "+ employees["LastName"]
employees.head()

,FirstName,LastName,CountryCode,RegionName,CommissionPct,Fullname
0,Amy,Alberts,GB,United Kingdom,0.000,Amy Alberts
1,David,Campbell,US,Northwest,0.012,David Campbell
2,Garrett,Vargas,CA,Canada,0.010,Garrett Vargas
3,Jae,Pak,CA,Canada,0.020,Jae Pak
4,Jillian,Carson,US,Southwest,0.015,Jillian Carson

### Pregunta: Cómo han cambiado las ganancias a través de los años?

In [89]:
sales.head()

   SalesOrderID    TotalDue  NumberofItems OnlineOrderFlag
0         43659  23153.2339             12         offline
1         43660   1457.3288              2         offline
2         43661  36865.8012             15         offline
3         43662  32474.9324             22         offline
4         43663    472.3108              1         offline

In [90]:
## merge: es un JOIN de SQL
sales_date= sales.merge(dates, on="SalesOrderID", how="left")
sales_date.head()

,SalesOrderID,TotalDue,NumberofItems,OnlineOrderFlag,OrderDate,ShipDate
0,43659,23153.2339,12,offline,2011-05-31,2011-06-07
1,43660,1457.3288,2,offline,2011-05-31,2011-06-07
2,43661,36865.8012,15,offline,2011-05-31,2011-06-07
3,43662,32474.9324,22,offline,2011-05-31,2011-06-07
4,43663,472.3108,1,offline,2011-05-31,2011-06-07

Crear columnas de año y mes:

In [92]:
sales_date["OrderYear"] = sales_date["OrderDate"].dt.year
sales_date["OrderYM"] = sales_date["OrderDate"].dt.strftime("%Y-%m")
sales_date.head()

,SalesOrderID,TotalDue,NumberofItems,OnlineOrderFlag,OrderDate,ShipDate,OrderYear,OrderYM
0,43659,23153.2339,12,offline,2011-05-31,2011-06-07,2011,2011-05
1,43660,1457.3288,2,offline,2011-05-31,2011-06-07,2011,2011-05
2,43661,36865.8012,15,offline,2011-05-31,2011-06-07,2011,2011-05
3,43662,32474.9324,22,offline,2011-05-31,2011-06-07,2011,2011-05
4,43663,472.3108,1,offline,2011-05-31,2011-06-07,2011,2011-05

Agrupar por año para extraer la ganancia:

In [94]:
# groupby
sales_by_year = sales_date.groupby("OrderYear").sum().reset_index()
sales_by_year.head()

   OrderYear  SalesOrderID      TotalDue  NumberofItems
0       2011      71450434  1.415570e+07           5716
1       2012     184878045  3.767570e+07          21689
2       2013     798042413  4.896589e+07          56573
3       2014     814366923  2.241950e+07          37339

#### Visualización: gráfico de barras

In [ ]:
ordenA=["2011","2012", "2013", "2014"]
sns.barplot(x="OrderYear", y="TotalDue", data=sales_by_year)

In [ ]:
sns.lineplot(x="timepoint", y="signal",
             hue="region", style="event",
             data=fmri)